from datetime import datetime


def get_days_from_today(date):
    """
    Функція, яка розраховує кількість днів між заданою датою і поточною датою.
    """
    return (datetime.now().date() - datetime.strptime(date, "%Y-%m-%d").date()).days


if __name__ == "__main__":
    print("Домашнє завдання №1")
    print("кількість днів між заданою датою і поточною датою\n")

    # Функція приймає один параметр: date — рядок, що представляє дату у форматі 'РРРР-ММ-ДД' (наприклад, '2020-10-09').
    # Функція повертає ціле число, яке вказує на кількість днів від заданої дати до поточної.
    # Якщо задана дата пізніша за поточну, результат має бути від'ємним.
    # У розрахунках необхідно враховувати лише дні, ігноруючи час (години, хвилини, секунди).
    # Для роботи з датами слід використовувати модуль datetime Python.

    print(f"Сьогодні {datetime.now().date()}\n{'-'*20}")
    for date in ["2037-11-12", "2027-03-24", "2020-12-07", "1990-08-12", "2027-03-24"]:
        print(f"різниця днів {date} із сьогодні = {get_days_from_today(date)}")
